Revit 2027 API
ParameterTypeId.SpaceConditionType Property
 "Condition Type"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SpaceConditionType { get; }
Public Shared ReadOnly Property SpaceConditionType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SpaceConditionType {
	ForgeTypeId^ get ();
}
static member SpaceConditionType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace